Home Work week 8

In [2]:
import pandas as pd
import numpy as np

In [7]:
pwd

'C:\\Users\\fayal\\DSE210X'

In [17]:
data=pd.read_csv("titanic/train.csv")

In [18]:
data.shape

(891, 12)

In [21]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [59]:
filtered_data=data[['Survived','Pclass','Sex','Cabin']].copy()
filtered_data.shape

(891, 4)

In [60]:
filtered_data.head()

   Survived  Pclass     Sex Cabin
0         0       3    male   NaN
1         1       1  female   C85
2         1       3  female   NaN
3         1       1  female  C123
4         0       3    male   NaN

In [104]:
filtered_data[(filtered_data.Pclass==1) & (filtered_data.Sex=='female')]['Survived'].value_counts(normalize=True)

1    0.968085
0    0.031915
Name: Survived, dtype: float64

In [108]:
#probability female in first class
filtered_data[(filtered_data.Survived==1)]['Pclass'].value_counts(normalize=True)

1    0.397661
3    0.347953
2    0.254386
Name: Pclass, dtype: float64

In [65]:
filtered_data.Survived.value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [66]:
female_survivors=filtered_data[filtered_data['Sex']=='female']
female_survivors.Survived.value_counts(normalize=True)

1    0.742038
0    0.257962
Name: Survived, dtype: float64

In [78]:
female_survivors.head()

   Survived  Pclass     Sex Cabin
1         1       1  female   C85
2         1       3  female   NaN
3         1       1  female  C123
8         1       3  female   NaN
9         1       2  female   NaN

In [81]:
female_survivors.groupby('Pclass').count()

        Survived  Sex  Cabin
Pclass
1             94   94     81
2             76   76     10
3            144  144      6

In [82]:
94/(94+76+144)

0.29936305732484075

In [90]:
0.299/0.435

0.6873563218390805

Probability that a person is a female and survives: P(F and S)=P(F)* P(S)

In [72]:
p_female=filtered_data.Sex.value_counts(normalize=True)
p_female

male      0.647587
female    0.352413
Name: Sex, dtype: float64

In [74]:
p_female_and_survived=0.742*0.3524
p_female_and_survived

0.2614808

#another way to find how many rows are NaN
filtered_data.isna().sum()

In [29]:
rows_before=filtered_data.shape[0]
rows_before

891

In [30]:
filtered_data=filtered_data.dropna()

In [32]:
rows_after=filtered_data.shape[0]
rows_after

204

In [51]:
survived=filtered_data['Survived'].value_counts().to_dict()
survived

{1: 136, 0: 68}

In [ ]:
type(survived[1]+survived[0])

In [58]:
prob_survived=survived[1]/(survived[1]+survived[0])
prob_survived

0.6666666666666666